# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
depth_multiple: 0.67  # model depth multiple  用于计算module的重复次数
width_multiple: 0.75  # layer channel multiple 用于计算每一层的输出通道数

########### [DSAI] 确定Anchors信息 ############

# input_size: 640
# nc: 1  # number of classes
# nid: 572
# anchors:  ### MOT17
#   - [2,2, 3,4, 5,8]  # P3/8        13,7, 21,11, 15,18
#   - [10,6, 7,14, 18,8]  # P4/16      34,16, 24,29, 51,22
#   - [13,14, 19,29, 34,17]  # P5/32    66,40, 79,81, 196,112
# feature_dim: 128

####################DroneView_Vehicle_20221028#################
input_size: 640
nc: 1  # number of classes
nid: 477
anchors:  ### MOT17
  - [2,2, 3,4, 5,8]  # P3/8        13,7, 21,11, 15,18
  - [10,6, 7,14, 18,8]  # P4/16      34,16, 24,29, 51,22
  - [13,14, 19,29, 34,17]  # P5/32    66,40, 79,81, 196,112
feature_dim: 128


# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 9
  ]

# # YOLOv5 v6.0 head
# head:
#   [[-1, 1, Conv, [512, 1, 1]],
#    [-1, 1, nn.Upsample, [None, 2, 'nearest']],
#    [[-1, 6], 1, Concat, [1]],  # cat backbone P4
#    [-1, 3, C3, [512, False]],  # 13

#    [-1, 1, Conv, [256, 1, 1]], # 14
#    [-1, 1, nn.Upsample, [None, 2, 'nearest']],
#    [[-1, 4], 1, Concat, [1]],  # cat backbone P3
#    [-1, 3, C3, [256, False]],  # 17 (P3/8-small cell)     80*80( [KSAI] 对应小anchors尺寸)

#    [-1, 1, Conv, [256, 3, 2]], # 18
#    [[-1, 14], 1, Concat, [1]], # 19 cat head P4
#    [-1, 3, C3, [512, False]],  # 20 (P4/16-medium cell)   40*40

#    [-1, 1, Conv, [512, 3, 2]], # 22
#    [[-1, 10], 1, Concat, [1]], # 22 cat head P5
#    [-1, 3, C3, [1024, False]], # 23 (P5/32-large cell)   20*20

#    [[17, 20, 23], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
# ]


head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 13

   [-1, 1, Conv, [256, 1, 1]], # 14
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 17 (P3/8-small cell)     80*80( [KSAI] 对应小anchors尺寸)

   [-1, 1, Conv, [256, 3, 2]], # 18
   [[-1, 14], 1, Concat, [1]], # 19 cat head P4
   [-1, 3, C3, [512, False]],  # 20 (P4/16-medium cell)   40*40

   [-1, 1, Conv, [512, 3, 2]], # 22
   [[-1, 10], 1, Concat, [1]], # 22 cat head P5
   [-1, 3, C3, [1024, False]], # 23 (P5/32-large cell)   20*20

   [[17, 20, 23], 1, Detect, [input_size, nc, anchors, feature_dim, nid]],  # Detect(P3, P4, P5)
  ]